# ============================================================
# FastAPI import
# ============================================================

# FastAPI:
#
# 고성능 Python API 서버 프레임워크
#
# 금융권에서는:
#
# 실시간 AI 추론 서버
#
# 역할
#
# 거래 요청 수신
# 모델 호출
# 결과 반환

from fastapi.responses import HTMLResponse
from fastapi.templating import Jinja2Templates
from fastapi import Request
from fastapi import FastAPI

# ============================================================
# 모델 저장/로드
# ============================================================
# 학습된 모델(.pkl) 로드용
import joblib

# ============================================================
# DataFrame 생성용
# ============================================================
# 모델 입력 형식 맞추기
import pandas as pd


# ============================================================
# 거래 요청 객체
# ============================================================
# API 요청 JSON
#
# →
#
# Python 객체 자동 변환
from schemas.transaction import Transaction


# ============================================================
# Redis 상태 서비스
# ============================================================
# 고객 이전 상태 조회
#
# 거래 후 상태 저장
from services.redis_service import (
    get_customer_state,
    save_customer_state
)

# ============================================================
# Feature 생성 엔진
# ============================================================

# 현재 거래
# +
# 이전 고객 상태
#
# →
#
# AI 입력값 생성
from services.feature_engineering import (
    create_features
)


# ============================================================
# Risk 점수 계산
# ============================================================

# Fraud 확률
#
# →
#
# 승인/MFA/차단

from services.risk_scoring import (
    calculate_risk
)


# ============================================================
# FastAPI 객체 생성
# ============================================================

# API 서버 시작점

app = FastAPI()
templates = Jinja2Templates(directory="/app/app/templates")


# ============================================================
# 모델 로드
# ============================================================

# 서버 시작 시
#
# 메모리로 로드
#
# 매 요청마다 파일 읽으면 느림

# ============================================================
# XGBoost 모델
# ============================================================
# 최종 Fraud Detection 모델
model = joblib.load("app/model/xgb_model.pkl")

# ============================================================
# KMeans 모델
# ============================================================
# 고객 그룹 생성 모델
kmeans = joblib.load("app/model/kmeans.pkl")


# ============================================================
# Scaler
# ============================================================
# 정규화 모델
scaler = joblib.load("app/model/scaler.pkl")


@app.get("/", response_class=HTMLResponse)
def home(request: Request):

    return templates.TemplateResponse(
        request=request,
        name="index.html",
        context={
            "request": request
        }
    )

# ============================================================
# 실시간 탐지 API
# ============================================================

# POST:
#
# /predict
#
# 예:
#
# POST /predict
#
# {
#   "cc_num":123,
#   "amt":900
# }

@app.post("/predict")
def predict(tx: Transaction):

    # ========================================================
    # 1. Redis 고객 상태 조회
    # ========================================================

    # 현재 거래만 보면 부족
    #
    # 이전 상태 필요
    #
    # 예:
    #
    # 거래 횟수
    # 평균 금액
    # 야간 비율

    state = get_customer_state(
        tx.cc_num
    )

    # ========================================================
    # 2. Feature 생성
    # ========================================================

    # 현재 거래
    #
    # +
    #
    # 이전 상태
    #
    # →
    #
    # AI Feature 생성

    features, updated_state = (

        create_features(
            tx,
            state
        )
    )

    # ========================================================
    # 3. KMeans 고객 세그먼트 생성
    # ========================================================

    # KMeans 입력 Feature

    segment_input = pd.DataFrame([{
        "transaction_count":
            features[
                "transaction_count"
            ],
        "avg_amount":
            features[
                "avg_amount"
            ],
        "night_ratio":
            features[
                "night_ratio"
            ],
        "avg_distance":
            features[
                "avg_distance"
            ]
    }])

    # ========================================================
    # 4. 정규화
    # ========================================================

    # 학습 때 사용한
    # 동일 Scaler 사용

    segment_scaled = scaler.transform(
        segment_input
    )

    # ========================================================
    # 5. 고객 그룹 예측
    # ========================================================

    # 예:
    #
    # Segment:
    #
    # 0 일반
    # 1 VIP
    # 2 야간형
    # 3 장거리형

    segment = (
        kmeans.predict(
            segment_scaled
        )[0]
    )

    # ========================================================
    # 6. Segment 추가
    # ========================================================

    # KMeans 결과를
    #
    # XGBoost Feature로 추가

    features["segment"] = segment

    # ========================================================
    # 7. XGBoost 입력 생성
    # ========================================================

    X = pd.DataFrame([
        features
    ])

    # ========================================================
    # 8. Fraud 확률 계산
    # ========================================================

    # predict_proba:
    #
    # [정상확률,사기확률]
    #
    # 예:
    #
    # [0.1,0.9]

    probability = (
        model.predict_proba(
            X
        )[0][1]
    )

    # ========================================================
    # [0][1] 의미
    # ========================================================

    # [0]
    #
    # 첫 번째 데이터
    #
    # [1]
    #
    # Fraud 확률


    # ========================================================
    # 9. Risk Score 계산
    # ========================================================

    # 확률
    #
    # →
    #
    # 업무 처리

    risk_score, action = (
        calculate_risk(
            probability
        )
    )


    # ========================================================
    # 10. Redis 상태 저장
    # ========================================================

    # 거래 완료 후
    #
    # 최신 상태 저장

    save_customer_state(
        tx.cc_num,
        updated_state
    )

    # ========================================================
    # 11. API 응답
    # ========================================================

    return {
        # 사기 확률
        "fraud_probability":
            float(
                probability
            ),
        # 위험 점수
        "risk_score":
            float(
                risk_score
            ),

        # 승인 정책
        "action":
            action,

        # 고객 그룹
        "segment":
            int(segment)

    }

